# Objectives
# - Only install clients application on main system (i.e. mongodo-compass)
# - Use docker-compose to run services (i.e. mongodb)

tap 'buo/cask-upgrade'
# Non-official Flutter TODO: update when brew has official flutter
tap 'eclewlow/formulas'
tap 'getantibody/tap'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
# Tiling Window Manager https://github.com/koekeishiya/chunkwm
#tap 'crisidev/homebrew-chunkwm'

# Shell plugin manager http://getantibody.github.io
brew 'getantibody/tap/antibody'

# Clone of `cat` with syntax highlighting and git integration
brew 'bat'

# Open source password manager https://bitwarden.com
brew 'bitwarden-cli'

# Command line cheatsheets https://github.com/chrisallenlane/cheat
brew 'cheat'

# Tiling Window Manager https://github.com/koekeishiya/chunkwm
#brew 'chunkwm'

brew 'diff-so-fancy'

# Select default applications for document types http://duti.org
brew 'duti'

# Modern replacement for `ls` https://the.exa.website
brew 'exa'

# `find` utility https://www.gnu.org/software/findutils/
brew 'findutils', args: ['with-default-names']

# Fuzzy finder https://github.com/junegunn/fzf
brew 'fzf'

# Flutter (unoffical https://github.com/eclewlow/homebrew-formulas)
brew 'flutter'

# Git version control
brew 'git'
brew 'git-lfs'

# Wrapper for git https://hub.github.com
brew 'hub'

# Image manipulation https://www.imagemagick.org/
brew 'imagemagick'

# Pretty print json files
brew 'jq'

# Lua language https://www.lua.org
brew 'lua'

# Mac App Store CLI
brew 'mas'

# Node
# brew 'node'

# Node version manager https://github.com/creationix/nvm
brew 'nvm'

# Install SSH key on server https://www.ssh.com/ssh/copy-id
brew 'ssh-copy-id'

# Send MacOS notifications from CLI
brew 'terminal-notifier'

# Simplified man pages https://tldr.sh
brew 'tldr'

# Recursive directory listing http://mama.indstate.edu/users/ice/tree/
brew 'tree'

# Vim Editor
brew 'vim'

# Time tracking in terminal https://wakatime.com/terminal
brew "wakatime-cli"

# Package manager https://yarnpkg.com/en/
brew 'yarn'

# Track most used directories makes cd smarter https://github.com/rupa/z
brew 'z'

# Zsh shell http://www.zsh.org
brew 'zsh'

# Suggest previous commands https://github.com/zsh-users/zsh-autosuggestions
brew 'zsh-autosuggestions'

# https://github.com/zsh-users/zsh-syntax-highlighting
brew 'zsh-syntax-highlighting'

# Java
# brew 'jenv'
# brew 'gradle'
# brew 'maven'

# Databases
# brew 'mongodb'
# brew 'postgresql'
# brew 'sqlite'
# brew 'mysql'
# brew 'redis'

# brew 'coreutils'
# brew 'fish'
# brew 'gdb'
# brew 'glib'
# brew 'nginx'
# brew 'openssl'
# brew 'swagger-codegen'
# brew 'wget'
# brew 'valgrind'
# brew 'tmux'
# brew 'overmind'

# I have an Alfred2 license, not Alfred3
cask 'alfred2'
cask 'android-studio-preview'
# cask 'bisq'
cask 'bitwarden'
# cask 'boostnote'
# Hold down cmd key and see cheatsheet for current app
cask 'cheatsheet'
cask 'clipy'
# Checksum doesn't match
# cask 'dashlane'
cask 'discord'
# Docker for Mac
cask 'docker'
#cask 'dropbox'
#cask 'docker'
cask 'etcher'
cask 'evernote'
#cask 'exodus'
cask 'filebot'
cask 'firefox'
# Fonts
cask 'font-consolas-for-powerline'
cask 'font-fira-code'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'gimp'
cask 'gitter'
cask 'google-chrome'
cask 'google-chrome-canary'
# cask 'google-drive'
# cask 'google-drive-file-stream'
# cask 'google-earth-pro'
# cask 'google-play-music-desktop-player'
# cask 'graphiql'
cask 'hammerspoon'
cask 'inboxer'
cask 'insomnia'
cask 'iterm2'
cask 'java'
# cask 'kaleidoscope'
# cask 'karabiner-elements'
cask 'keepassx'
# cask 'meld'
cask 'minikube'
cask 'mongodb-compass-community'
cask 'ngrok'
cask 'notion'
cask 'odrive'
# cask 'pgadmin4'
# Client for PostgreSQL https://eggerapps.at/postico/
# cask 'postico'
# cask 'postman'
# Quick Look plugins
# https://github.com/anthonygelibert/QLColorCode
cask 'qlcolorcode'
# https://github.com/Nyx0uf/qlImageSize
cask 'qlimagesize'
# https://github.com/sindresorhus/quick-look-plugins
cask 'qlmarkdown'
# https://github.com/whomwah/qlstephen
cask 'qlstephen'
cask 'quickbooks-online'
# https://github.com/sindresorhus/quick-look-plugins
cask 'quicklook-json'
# cask 'rescuetime'
cask 'sketch'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'station'
cask 'stay'
cask 'telegram'
cask 'tunnelblick'
# cask 'vagrant'
# cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
# cask 'vnc-viewer'
# https://github.com/dchest/webp-quicklook
cask 'webpquicklook'
# cask 'zeplin'

# cask 'adobe-air'
# cask 'android-sdk'
# cask 'android-studio'
# cask 'bartender'
cask 'brave-browser'
# cask 'battle-net'
# cask 'caret'
# cask 'citrix-receiver'
# cask 'cleanmymac'
# cask 'daisydisk'
# cask 'docker'
# cask 'flux'
# cask 'godot'
# cask 'intellij-idea'
# cask 'insomnia'
# cask 'java8'
# cask 'little-snitch'
# cask 'love'
# cask 'mac2imgur'
# cask 'microsoft-office'
# cask 'microsoft-teams'
# cask 'mysqlworkbench'
# cask 'paintbrush'
# cask 'pgadmin4'




# cask 'real-vnc'
# cask 'skype'
# cask 'soulseek'
# cask 'soundflower'
# cask 'spotify'
# cask 'starleaf'
# cask 'steam'
# cask 'teamviewer'
# cask 'telegram'
# cask 'the-unarchiver'
# cask 'transmission'
# cask 'unity'
# cask 'viscosity'
# cask 'vmware-fusion'
# cask 'whatsapp'
# cask 'xerox-print-driver'
# cask 'xquartz'

mas 'Amphetamine', id: 937984704
# mas 'Microsoft Remote Desktop 10', id: 1295203466
# mas 'Shotty', id: 1250306151
# mas 'Unclutter', id: 577085396
mas 'Xcode', id: 497799835
